Revit 2024 API
AppearanceAssetEditScope.Start Method
 Starts the edit scope.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public Asset Start(
	ElementId assetElementId
)
Visual Basic
Public Function Start ( _
	assetElementId As ElementId _
) As Asset
Visual C++
public:
Asset^ Start(
	ElementId^ assetElementId
)
Parameters
assetElementId
Type: Autodesk.Revit.DB.ElementId
 The appearance asset element whose asset should be edited.
Return Value
 The appearance asset to be used for editing.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AppearanceAssetEditScope Class
Autodesk.Revit.DB.Visual Namespace